In [1]:
import pandas as pd

In [2]:
d=pd.Series(range(20))

In [4]:
d.cumsum()

0       0
1       1
2       3
3       6
4      10
5      15
6      21
7      28
8      36
9      45
10     55
11     66
12     78
13     91
14    105
15    120
16    136
17    153
18    171
19    190
dtype: int64

In [5]:
dt={'one':pd.Series([1,2,3],index=['a','b','c']),
   'two':pd.Series([9,8,7,6],index=['a','b','c','d'])}

In [6]:
d=pd.DataFrame(dt)

In [7]:
d

   one  two
a  1.0    9
b  2.0    8
c  3.0    7
d  NaN    6

In [9]:
pd.DataFrame(dt,index=['b','c','d'],columns=['two','three'])

   two three
b    8   NaN
c    7   NaN
d    6   NaN

In [ ]:
d